Courses/4420/Lectures/SecSoftware/secsoftware-lab-2018.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-01 Thu 00:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab: Software without Security Holes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Lab: Software without Security Holes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org367f1db">1. Overview</a>
<ul>
<li><a href="#org21797c5">1.1. Prerequisite</a></li>
</ul>
</li>
<li><a href="#org417753e">2. Tasks</a>
<ul>
<li><a href="#org201a841">2.1. Task: Effective Use of Splint</a></li>
<li><a href="#orgbb09154">2.2. Task: Analyze AlephOne C Files</a></li>
<li><a href="#orge478569">2.3. Task: Analyze sudo</a></li>
<li><a href="#orgb795550">2.4. Task: RATS, valgrind, and Uno</a></li>
<li><a href="#org31a2714">2.5. Task: Code Style</a></li>
</ul>
</li>
<li><a href="#orgff2d3d4">3. Tasks: [Bonus][Optional]</a>
<ul>
<li><a href="#orgafd2d69">3.1. Task: sudo keeps growing!</a></li>
<li><a href="#org74bfd5c">3.2. Task: Improve the man pages of sudo</a></li>
</ul>
</li>
<li><a href="#orgd14dda4">4. Submission</a></li>
<li><a href="#orgd03b1f1">5. References</a></li>
<li><a href="#org30f0e78">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-org367f1db" class="outline-2">
<h2 id="org367f1db"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Objective: Introduce you to formal methods based tools.  Get you to
think about secure programming some more.</li>
</ol>
</div>

<div id="outline-container-org21797c5" class="outline-3">
<h3 id="org21797c5"><span class="section-number-3">1.1</span> Prerequisite</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Install splint: <code>sudo apt install splint</code></li>
<li>Download the source code of the latest stable release of <code>sudo</code>
from <a href="http://www.sudo.ws/sudo/">http://www.sudo.ws/sudo/</a>.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org417753e" class="outline-2">
<h2 id="org417753e"><span class="section-number-2">2</span> Tasks</h2>
<div class="outline-text-2" id="text-2">
<p>
Not all tasks are equal in difficulty.  Devote your time wisely on
what interests you most.  But, do not omit any task.
</p>
</div>


<div id="outline-container-org201a841" class="outline-3">
<h3 id="org201a841"><span class="section-number-3">2.1</span> Task: Effective Use of Splint</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Answer the following questions.  Some of them are answered in the
Splint manual.</li>
<li>What is an <i>assertion</i>? For <code>exploit4.c</code> of Aleph One, give an
example assertion that you can place just above the second
for-loop.</li>
<li>The C/C++ data type <code>char</code> can be used as an <code>int</code>.  (i) Is it
signed or unsigned?  (ii) Are the types of p and q declared as in
<code>char *p</code> and <code>char q[]</code> the same? (iii) Of the two signatures of
typical main method of C programs shown here, which is to be
preferred and why?
<ol class="org-ol">
<li><code>int main (unsigned int argc, char **argv, char ** envp)</code></li>
<li><code>int main (unsigned int argc, char *argv[], char ** envp)</code></li>
</ol></li>

<li><p>
Explain the meaning (in your own words, not by a cut-n-paste) of
the Splint annotations shown in the following line of C code:
</p>
<pre class="example">
typedef /*@abstract@*/ /*@immutable@*/ int weekDay;

</pre></li>
</ol>
</div>
</div>

<div id="outline-container-orgbb09154" class="outline-3">
<h3 id="orgbb09154"><span class="section-number-3">2.2</span> Task: Analyze AlephOne C Files</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>The C src code files from AlephOne's article are collected here:
<a href="../BufferOverflow/AlephOne/">../BufferOverflow/AlephOne/</a></li>

<li>Run <code>splint</code> on <code>exploit4.c</code> of Aleph One.  Revise the code of
<code>exploit4.c</code>, and adjust the flags of <code>splint</code> so that all errors
and warnings shown by <code>splint</code> are gone.  Include in the lab report
the content of <code>exploit4Revised.c</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-orge478569" class="outline-3">
<h3 id="orge478569"><span class="section-number-3">2.3</span> Task: Analyze sudo</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Download the source code of the latest stable release of <code>sudo</code>
from <a href="http://www.sudo.ws/sudo/">http://www.sudo.ws/sudo/</a>.  Build it.  Read the included man
page, not <code>man sudo</code>.  Check that it "works."  Submit details of
how you checked.</li>

<li>Run <code>splint</code>, with no flags (except for include-related),
collectively on all the source code files of <code>sudo</code>.  Insert all
its messages into the lab report as an appendix.</li>

<li>Select <i>three</i> interesting messages regarding source code errors
generated by splint, and explain the messages and the causes for
their generation.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb795550" class="outline-3">
<h3 id="orgb795550"><span class="section-number-3">2.4</span> Task: RATS, valgrind, and Uno</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Use the tools named RATS, valgrind, and UNO (Section Source Code
Analysis of <a href="../SecSoftware">../SecSoftware</a>) on the source code files and/or the sudo program built
from the above.
<ol class="org-ol">
<li><a href="https://security.web.cern.ch/security/recommendations/en/codetools/rats.shtml">https://security.web.cern.ch/security/recommendations/en/codetools/rats.shtml</a></li>
<li><a href="http://valgrind.org/docs/manual/quick-start.html">http://valgrind.org/docs/manual/quick-start.html</a></li>
<li><a href="http://open-tube.com/10-free-tools-for-static-code-analysis/">http://open-tube.com/10-free-tools-for-static-code-analysis/</a>;
[Optional] You ought to read this <a href="https://www.researchgate.net/publication/2564922_UNO_Static_Source_Code_Checking_for_UserDefined_Properties/download">PDF</a> also.</li>
</ol></li>

<li>Select and discuss five discoveries made by each of the tools.
Total 15 items.</li>
<li>Write a comparative review of the tools.</li>
</ol>
</div>
</div>

<div id="outline-container-org31a2714" class="outline-3">
<h3 id="org31a2714"><span class="section-number-3">2.5</span> Task: Code Style</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Holzmann's paper (see the References of <a href="../SecSoftware">../SecSoftware</a>) presents "Ten Rules for
Writing Safety Critical Code":
<ol class="org-ol">
<li>Restrict to simple control flow constructs.</li>
<li>Give all loops a fixed upper-bound.</li>
<li>Do not use dynamic memory allocation after initialization.</li>
<li>Limit functions to no more than 60 lines of text.</li>
<li>Use minimally two assertions per function on average.</li>
<li>Declare data objects at the smallest possible level of scope.</li>
<li>Check the return value of non-void functions, and check the
validity of function parameters.</li>
<li>Limit the use of the preprocessor to file inclusion and simple macros.</li>
<li>Limit the use of pointers. Use no more than two levels of
dereferencing per expression.</li>
<li>Compile with all warnings enabled, and use one or more source
code analyzers.</li>
</ol></li>
<li>List all violations of these rules that <code>sudo</code> makes.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgff2d3d4" class="outline-2">
<h2 id="orgff2d3d4"><span class="section-number-2">3</span> Tasks: [Bonus][Optional]</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgafd2d69" class="outline-3">
<h3 id="orgafd2d69"><span class="section-number-3">3.1</span> Task: sudo keeps growing!</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>The tar ball sizes of a few sudo versions are shown
below.  Summarize what has improved.  Explain the increase in size.

<ol class="org-ol">
<li><code>-rw-r--r-- 1 pmateti pmateti 0349785 2003</code> <a href="./sudo-1.6.7p5.tar.gz">sudo-1.6.7p5.tar.gz</a></li>
<li><code>-rw-r--r-- 1 pmateti pmateti 1608969 2012</code> <a href="http://www.sudo.ws/sudo/dist/sudo-1.8.4p4.tar.gz">sudo-1.8.4p4.tar.gz</a></li>
<li><code>-rw-rw-r-- 1 pmateti pmateti 2117145 2013</code> <a href="http://www.sudo.ws/sudo/dist/sudo-1.8.8.tar.gz">sudo-1.8.8.tar.gz</a></li>
<li><code>-rw-rw-r-- 1 pmateti pmateti 2976081 2017</code> <a href="https://www.sudo.ws/dist/sudo-1.8.21p2.tar.gz">sudo-1.8.21p2.tar.gz</a></li>
<li><code>-rw-rw-r-- 1 pmateti pmateti 3189951 2018</code> <a href="https://www.sudo.ws/dist/sudo-1.8.25p1.tar.gz">sudo-1.8.25p1.tar.gz</a></li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org74bfd5c" class="outline-3">
<h3 id="org74bfd5c"><span class="section-number-3">3.2</span> Task: Improve the man pages of sudo</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Study the different versions of the man pages of sudo that are in
these tar balls.  Focus on the "seven sins of the specifier",
namely, 1. Noise, 2. Silence: 3. Overspecification, 4. Contradiction, 5. Ambiguity, 6. Forward
Reference, 7. Wishful Thinking (from Bertrand Meyer 1985).  Do you
find that the man pages became better or worse over the years.
Write up your findings.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgd14dda4" class="outline-2">
<h2 id="orgd14dda4"><span class="section-number-2">4</span> Submission</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="./SecSoftwareLabGS.html">Lab-1 Grading Sheet</a></li>
<li>You must follow the <a href="../Overview/labReports.html">Lab Report Template</a>.  There should be a section
on each of the tasks.  A couple of lines of an answer to each
(implied/ explicit) question/ discussion item.</li>
<li>Use good judgement and do not make the report way
longer than, say, 20 pages.  Submit explanations and code that
verifies your answers.</li>
<li>The Lab Report should include a section that describes the chosen
LXU briefly, and a detailed section explaining the rationale behind
the changes (what and why) you suggest.</li>
<li>Submit a PDF file named <b>exactly</b> <code>Report-L2.pdf</code>. (Scripts are
used to check various things &#x2013; so file names should obey such
"rules".)</li>
</ol>
</div>
</div>

<div id="outline-container-orgd03b1f1" class="outline-2">
<h2 id="orgd03b1f1"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Prabhaker Mateti, <a href="../SecSoftware">../SecSoftware</a> 2018. Required Reading.</li>
</ol>
</div>
</div>

<div id="outline-container-org30f0e78" class="outline-2">
<h2 id="org30f0e78"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-09-18
</div>
</body>
</html>
